cxf-webapp/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCityRequest>
         <gs:zipCode>35410</gs:zipCode>
      </gs:getCityRequest>
   </soapenv:Body>
</soapenv:Envelope>